tap "felixkratz/formulae"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "shopify/shopify"
tap "sst/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# PNG image optimizing utility
brew "pngquant"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Command-line interface for Vercel
brew "vercel-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Supabase CLI
brew "supabase/tap/supabase"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Manage team projects and tasks
cask "asana"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
cask "font-geist-mono-nerd-font"
cask "font-google-sans-code"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# App to write, plan, collaborate, and get organised
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
# Multiplayer code editor
cask "zed@preview"
vscode "anysphere.cursorpyright"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "coderabbit.coderabbit-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "esbenp.prettier-vscode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "killalau.vscode-liquid-snippets"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "saoudrizwan.claude-dev"
vscode "shopify.polaris-for-vscode"
vscode "shopify.theme-check-vscode"
vscode "shopify.vscode-shopify-dev-assistant"
vscode "traycer.traycer-vscode"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
