tap "caarlos0/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jnsahaj/lumen"
tap "jorgerojas26/lazysql"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "shopify/shopify"
tap "sst/tap"
tap "supabase/tap"
tap "tursodatabase/tap"
brew "ansible"
brew "ast-grep"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bat"
brew "btop"
brew "glib"
brew "cairo"
brew "ccache"
brew "cmake"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "python@3.12"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "make"
brew "mkcert"
brew "nasm"
brew "neofetch"
brew "neonctl"
brew "neovim"
brew "ninja"
brew "pipx"
brew "pkgconf"
brew "poetry"
brew "poppler"
brew "postgresql@17"
brew "pypy3.10"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "tig"
brew "tmux"
brew "unzip"
brew "wget"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "caarlos0/tap/timer"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jnsahaj/lumen/lumen"
brew "jorgerojas26/lazysql/lazysql"
brew "shopify/shopify/shopify-cli"
brew "sst/tap/opencode"
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"
cask "aerospace"
cask "alacritty"
cask "arc"
cask "devtoys"
cask "discord"
cask "docker"
cask "figma"
cask "font-commit-mono-nerd-font"
cask "font-firago"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "keyboardcleantool"
cask "keycastr"
cask "ngrok"
cask "orbstack"
cask "raycast"
cask "spotify"
cask "telegram"
cask "visual-studio-code@insiders"
cask "whatsapp"
cask "zed@preview"
cask "zoom"
vscode "vscodevim.vim"
